In [ ]:
# value_counts (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=lJzXh08i8a-sZjMn&t=457
# sort_values (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=Ln2ayAqaxgoLUyWU&t=1657
# rank (series) -> https://www.youtube.com/live/zTa4MIrGTIE?si=C5bVkyZ5y3URWq3k&t=2197
# sort_index (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=CC2yqbX4WRf4ya2t&t=2577
# set_index (dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=xXseRDnoyBgDd7JK&t=2937
# rename -> (series and dataframe)
# reset_index -> (series and dataframe) https://www.youtube.com/live/zTa4MIrGTIE?si=uR5FRVTfJweDPj3D&t=3087
# unique ->  (series) https://www.youtube.com/live/zTa4MIrGTIE?si=HtI0I4tK4WxbwvEV&t=3707
# nunique -> (series) https://www.youtube.com/live/zTa4MIrGTIE?si=XV5sqkUg0z9DP6Rx&t=3907
# isnull(s and d)/notnull(s and d)/hasnans(s)  -> https://www.youtube.com/live/zTa4MIrGTIE?si=cW8_QtOVLy0ptij0&t=4137
# dropna -> (series and dataframe) ->https://www.youtube.com/live/zTa4MIrGTIE?si=xUYJHm4HZaywRkVC&t=4497
# fillna -> (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=kkLOhQ8N-YsIRXfT&t=5057
#       `----> ffill, bfill,  -> (series and dataframe) -> forward fill, backward fill
# duplicated (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=Ifq1aBzUrmRa9akD&t=5417
# drop_duplicates (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=s608srdGOMkaSnOL&t=5387
# drop (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=FbIJOlfUX5cPHuFH&t=6287
# apply (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=-K9NgE9EqSZ-qHXa&t=6657
# isin 
# corr
# nlargest -> nsmallest 
# insert 
# copy

In [2]:
import numpy as np
import pandas as pd

In [3]:

langs = pd.read_csv('languages_perferences.csv')
langs

  Language  Year               Feeling
0   Python  1992               Golden💛
1       JS  1995              WebGod🕸️
2      C++  1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻
3        C  1980              Creator⚡

In [4]:
# value_counts (series and dataframe) , so in series it tell how many times each value occur, and in df it tells how many times each row occurs
langs.value_counts()

Language  Year  Feeling
C         1980  Creator⚡                1
C++       1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻    1
JS        1995  WebGod🕸️                1
Python    1992  Golden💛                 1
Name: count, dtype: int64

In [5]:

# sort values
langs.sort_values(by='Year',ascending=False) # if we not give by parameter then it will sort by first column by default
# if yourr df has missing values and you wanna sort them then use `na_position='first'` or `na_position='last'` is default

  Language  Year               Feeling
1       JS  1995              WebGod🕸️
0   Python  1992               Golden💛
2      C++  1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻
3        C  1980              Creator⚡

In [6]:
# you can also specify by multiple columns, see this example in the video clip ->  https://www.youtube.com/live/zTa4MIrGTIE?si=h0sz8gsWgtqdCguD&t=1877

# here we say if by year(descending) if value is same then sort by language(ascending)
langs.sort_values(by=['Year','Language'],ascending=[False,True])

  Language  Year               Feeling
1       JS  1995              WebGod🕸️
0   Python  1992               Golden💛
2      C++  1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻
3        C  1980              Creator⚡

In [7]:
# rank (series) -> https://www.youtube.com/live/zTa4MIrGTIE?si=C5bVkyZ5y3URWq3k&t=2197

langs['rank'] = langs['Year'].rank(ascending=False) # ascending false means highest values comes in top rank
langs

  Language  Year               Feeling  rank
0   Python  1992               Golden💛   2.0
1       JS  1995              WebGod🕸️   1.0
2      C++  1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻   3.0
3        C  1980              Creator⚡   4.0

In [8]:
# sort index (series and dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=CC2yqbX4WRf4ya2t&t=2577

langs.sort_index(ascending=False) # sort by index in descending order

  Language  Year               Feeling  rank
3        C  1980              Creator⚡   4.0
2      C++  1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻   3.0
1       JS  1995              WebGod🕸️   1.0
0   Python  1992               Golden💛   2.0

In [9]:
# set_index (dataframe) -> https://www.youtube.com/live/zTa4MIrGTIE?si=xXseRDnoyBgDd7JK&t

langs.set_index('Language')

          Year               Feeling  rank
Language
Python    1992               Golden💛   2.0
JS        1995              WebGod🕸️   1.0
C++       1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻   3.0
C         1980              Creator⚡   4.0

In [10]:
# rename index -> rename indexes in dataframe

langs.rename(index={0:'Py',1:'JS',2:'C++',3:'C'})

# rename columns in dataframe

langs.rename(columns={'Language':'Language_name','Year':'Year_of_release','rank':'Rank_by_year'})

  Language_name  Year_of_release               Feeling  Rank_by_year
0        Python             1992               Golden💛           2.0
1            JS             1995              WebGod🕸️           1.0
2           C++             1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻           3.0
3             C             1980              Creator⚡           4.0

In [11]:
# reset_index -> https://www.youtube.com/live/zTa4MIrGTIE?si=uR5FRVTfJweDPj3D&t=30
langs.rename(index={0:'Py',1:'JS',2:'C++',3:'C'}).reset_index()
# series to dataframe using reset_index(), so we can also use this method to convert series to dataframe, like we do with `to_frame()` method


# how to replace existing index without lossing it -> https://www.youtube.com/live/zTa4MIrGTIE?si=tBcaZvgfg4Vqzn0j&t=3237

  index Language  Year               Feeling  rank
0    Py   Python  1992               Golden💛   2.0
1    JS       JS  1995              WebGod🕸️   1.0
2   C++      C++  1986  Pointers👈🏻👉🏻👈🏻🫵🏻👆🏻👇🏻   3.0
3     C        C  1980              Creator⚡   4.0

In [12]:
# unique ->  (series) https://www.youtube.com/live/zTa4MIrGTIE?si=HtI0I4tK4WxbwvEV&t=3707
series1 = pd.Series([1, 2, 3, 3, 4, 4, 4, 5, 5, 5, 5,np.nan, np.nan]) # will treat all missing values as one
series1.unique() # gives unique values, in list(after removing duplicates)

# series1.drop_duplicates(keep='first') # keep='first' or 'last' or False , same but give in series

array([ 1.,  2.,  3.,  4.,  5., nan])

In [13]:
# nunique, will tell number of unique values, in series((after removing duplicates)) 
# does not include NaN values
series1.nunique()

5

In [14]:
# isnull , will true if null otherwise false
langs.isnull()

   Language   Year  Feeling   rank
0     False  False    False  False
1     False  False    False  False
2     False  False    False  False
3     False  False    False  False

In [45]:
langs.notnull() # same as isnull but opposite, will true if not null otherwise false

   Language  Year  Feeling  rank
0      True  True     True  True
1      True  True     True  True
2      True  True     True  True
3      True  True     True  True

In [16]:
# hasnans, will true if column has even a single missing value otherwise false (works on series only)
langs['Language'].hasnans # means langs['Language'] not any missing values

False

In [17]:
# dropna -> (series and dataframe) ->https://www.youtube.com/live/zTa4MIrGTIE?si=xUYJHm4HZaywRkVC
# make an dataframe of missing values

# in series it remove all missing values

""" in dataframe it takes `how` parameter (default is 'any' means any row that contains even single missing value will
 be dropped), which , if `how` = all it will drop rows only if all values in that row are missing,
 and `subset` which takes column names (list) and then drop rows where in given columns has missing values
 """

rng = np.random.default_rng(7)
a = rng.random(size=(5,3))
a[1] = np.nan
a[::2,-1] = np.nan
df = pd.DataFrame(a, index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df # will drop rows with any missing values

        one       two     three
a  0.625095  0.897214       NaN
c       NaN       NaN       NaN
e  0.005265  0.821228       NaN
f  0.467935  0.303032  0.278426
h  0.254870  0.445076       NaN

In [18]:
df.dropna(how='all') # will drop those rows only that has all missing values

        one       two     three
a  0.625095  0.897214       NaN
e  0.005265  0.821228       NaN
f  0.467935  0.303032  0.278426
h  0.254870  0.445076       NaN

In [19]:
df.dropna(subset=['three']) # will drop rows where 'three' column has missing values
df.dropna(subset=['three','one']) # will drop rows where 'three' or 'one' column has missing values,

        one       two     three
f  0.467935  0.303032  0.278426

In [20]:
df.ffill() # will replace all missing values with previous non-missing value in the same column

        one       two     three
a  0.625095  0.897214       NaN
c  0.625095  0.897214       NaN
e  0.005265  0.821228       NaN
f  0.467935  0.303032  0.278426
h  0.254870  0.445076  0.278426

In [21]:
df.bfill() # will replace all missing values with next non-missing value in the same column

        one       two     three
a  0.625095  0.897214  0.278426
c  0.005265  0.821228  0.278426
e  0.005265  0.821228  0.278426
f  0.467935  0.303032  0.278426
h  0.254870  0.445076       NaN

In [22]:
df.duplicated() # will return True if row is duplicated otherwise False

a    False
c    False
e    False
f    False
h    False
dtype: bool

In [48]:
# drop duplicates -> (series and dataframe) -> example: https://www.youtube.com/live/zTa4MIrGTIE?si=qA4637cXMzQRoQou&t=5597
#  understand subset parameter in drop_duplicates() method
# drop duplicates remove duplicated rows, 
# param `keep` parameter (default is 'first' means first occurrence of duplicated row will be kept, 
# 'last' means last occurrence will be kept, 
# 'False' means all duplicates will be dropped)

newdffx = pd.DataFrame({
    'A': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j','a'],
    'B': ['a', 'b', 'c', 'c', 'd', 'd', 'e', 'e', 'e', 'e','a'],
    'C': [1, 2, 3, 4, 5, 5, 6, 7, 8, 9,10]
})

newdffx.drop_duplicates(subset=['A', 'B'], keep='last') # will keep last occurrence of duplicate rows where A and B are same

# apply (series and dataframe)

    A  B   C
1   b  b   2
2   c  c   3
3   d  c   4
4   e  d   5
5   f  d   5
6   g  e   6
7   h  e   7
8   i  e   8
9   j  e   9
10  a  a  10

In [24]:
# drop (series and dataframe)
# in series
temp = pd.Series([1,2,2,3,4,5,6,7])
temp.drop(index=[1,3])

0    1
2    2
4    4
5    5
6    6
7    7
dtype: int64

In [25]:
# drop in dataframe
df.drop(columns=['three']) # can also drop index(rows)

        one       two
a  0.625095  0.897214
c       NaN       NaN
e  0.005265  0.821228
f  0.467935  0.303032
h  0.254870  0.445076

In [26]:
points_df = pd.DataFrame(
    {
        '1st point': [(3, 4), (-6, 5), (0, 0), (-10, 1), (4, 5)],
        '2nd point': [(-3, 4), (0, 0), (2, 2), (10, 10), (1, 1)]
    }
)

points_df

  1st point 2nd point
0    (3, 4)   (-3, 4)
1   (-6, 5)    (0, 0)
2    (0, 0)    (2, 2)
3  (-10, 1)  (10, 10)
4    (4, 5)    (1, 1)

In [27]:
# apply
def out(x):
    print(x)

points_df.apply(out) # so it apply funtion to each row in dataframe, by default axis=0 (means row wise)

0      (3, 4)
1     (-6, 5)
2      (0, 0)
3    (-10, 1)
4      (4, 5)
Name: 1st point, dtype: object
0     (-3, 4)
1      (0, 0)
2      (2, 2)
3    (10, 10)
4      (1, 1)
Name: 2nd point, dtype: object

1st point    None
2nd point    None
dtype: object

In [28]:
def eucledian_distance(row):
    print(row)
    return np.sqrt((row['1st point'][0] - row['2nd point'][0])**2 + (row['1st point'][1] - row['2nd point'][1])**2)

points_df['eucledian distance'] = points_df.apply(eucledian_distance, axis=1)
points_df # -> understand this example -> https://www.youtube.com/live/zTa4MIrGTIE?si=sImR4vCgzVbK8sRo&t=6927

1st point     (3, 4)
2nd point    (-3, 4)
Name: 0, dtype: object
1st point    (-6, 5)
2nd point     (0, 0)
Name: 1, dtype: object
1st point    (0, 0)
2nd point    (2, 2)
Name: 2, dtype: object
1st point    (-10, 1)
2nd point    (10, 10)
Name: 3, dtype: object
1st point    (4, 5)
2nd point    (1, 1)
Name: 4, dtype: object

  1st point 2nd point  eucledian distance
0    (3, 4)   (-3, 4)            6.000000
1   (-6, 5)    (0, 0)            7.810250
2    (0, 0)    (2, 2)            2.828427
3  (-10, 1)  (10, 10)           21.931712
4    (4, 5)    (1, 1)            5.000000

In [29]:
# isin 
# same datafrane 
newDf = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}) 
newDf

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [30]:
newDf.isin([1, 2]) # will return True if value is in the dataframe otherwise False

       A      B      C
0   True  False  False
1   True  False  False
2  False  False  False

In [ ]:
# corr
# description -> corr returns correlation coefficient between columns or rows of a DataFrame. 
# The correlation coefficient is a measure of the linear relationship between two variables.
# It ranges from -1 to 1, where -1 indicates a perfect negative correlation, 0 indicates no correlation, and 1 indicates a perfect positive correlation.
# In pandas, the corr() method computes the correlation matrix for the DataFrame.
# in numpy it is `np.corrcoef()`
# example

import pandas as pd
import numpy as np

# Create a DataFrame
data77 = {
    'A': [1, 2, 3, 4, 5],
    'B': [5, 4, 3, 2, 1],
    'C': [2, 3, 4, 5, 6]
}

df77 = pd.DataFrame(data77)

# Compute the correlation matrix

correlation_matrix = df77.corr()

correlation_matrix # so it calculates corr between all columns and returns a dataframe of correlation coefficients

     A    B    C
A  1.0 -1.0  1.0
B -1.0  1.0 -1.0
C  1.0 -1.0  1.0

In [ ]:
# nlargest -> nsmallest (series and dataframe)
# nlargest(n, columns) -> returns top n largest values in the given column(s)
# in series 
# nlargest(n) -> returns top n largest values in the series
# nsmallest(n) -> returns top n smallest values in the series
sampleSer = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])


correlation_matrix.nlargest(2, 'A') # top 2 largest values in column 'A', # nsmallest is just opposite
correlation_matrix.nsmallest(2, 'A') # top 2 smallest values in column 'A'

9    10
8     9
7     8
dtype: int64

     A    B    C
B -1.0  1.0 -1.0
A  1.0 -1.0  1.0

In [40]:
# insert -> description -> insert() method in pandas is used to insert a new column into a DataFrame at a specified location.
# This method allows you to specify the index (position) where the new column should be inserted, the name of the new column, and the values for that column.
# The values can be a list, Series, or array-like object that matches the length of the DataFrame.
# The method modifies the DataFrame in place and does not return a new DataFrame.
# example

import pandas as pd

# Create a DataFrame

data799 = {
    'A': [1, 2, 3, 4, 5],
    'B': [5, 4, 3, 2, 1]
}

df799 = pd.DataFrame(data799)

# Insert a new column 'C' at index 1
df799.insert(1, 'C', [10, 20, 30, 40, 50])
# The new column 'C' will be inserted between columns 'A' and 'B'
df799

   A   C  B
0  1  10  5
1  2  20  4
2  3  30  3
3  4  40  2
4  5  50  1

In [43]:
# copy -> description -> The copy() method in pandas is used to create a deep copy of a DataFrame or Series.
# A deep copy means that a new object is created, and the data is copied to this new object.
# This is different from a shallow copy, where the new object shares the same data as the original object like in view.
# When you modify the copied object, the original object remains unchanged.
# Example:

newdf799 = df799.copy()

newdf799['A'] = 100 # this will not change the original df799, but if we do shallow copy then it will change the original one
df799 # this will print original df799

   A   C  B
0  1  10  5
1  2  20  4
2  3  30  3
3  4  40  2
4  5  50  1